ETL/Catalogs/Обработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Обработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиВнешнейОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаПолучения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаПолученияНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаОтчетность</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаОтчетностьНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиВнешнейОбработкиОтчетность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнешнихОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/Обработки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//***************************************************************************************************
&НаКлиенте
Процедура ОбработкаПолученияНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Данные = СохранитьНаСервере();
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогОткрытияФайла.Фильтр				 = НСтр("ru = 'Все файлы'; en = 'All files'")  + "(*.*)|*.*";
	ДиалогОткрытияФайла.Заголовок			 = "Выберите файл";
	ДиалогОткрытияФайла.ПолноеИмяФайла		 = "";
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда

		АдресОбработки = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла), Объект.Ссылка.УникальныйИдентификатор());

		МассивСтрок = СтрРазделить(ДиалогОткрытияФайла.ПолноеИмяФайла, "\");
		
		Объект.ДатаЗагрузкиВнешнейОбработки		 = ТекущаяДата();
		Объект.ОбработкаПолученияНаименование	 = МассивСтрок.Получить(МассивСтрок.Количество() - 1);
		
	КонецЕсли;
	
КонецПроцедуры
//***************************************************************************************************
&НаСервере
Функция СохранитьНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Возврат  Об.ОбработкаПолучения.Получить();
	//Возврат Справочники.Обработки.ПолучитьОбработку(РеквизитФормыВЗначение("Объект"));
	
КонецФункции
//***************************************************************************************************
&НаКлиенте
Процедура Сохранить(Команда)
	
	Данные = СохранитьНаСервере();
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогОткрытияФайла.Фильтр				 = "Произвольный (*." + Прав(Объект.ОбработкаПолученияНаименование, 3) + ")|*." + Прав(Объект.ОбработкаПолученияНаименование, 3);
	ДиалогОткрытияФайла.Заголовок			 = "Выберите файл";
	ДиалогОткрытияФайла.ПолноеИмяФайла		 = Объект.ОбработкаПолученияНаименование;
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		Данные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		
	КонецЕсли;     
	
КонецПроцедуры
//***************************************************************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаСохранить.Доступность = ЗначениеЗаполнено(Объект.ОбработкаПолученияНаименование);
	
КонецПроцедуры
//***************************************************************************************************
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(АдресОбработки) Тогда 

		ТекущийОбъект.ОбработкаПолучения = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СокрЛП(АдресОбработки)));
	
	КонецЕсли;

	Если ЗначениеЗаполнено(АдресОбработкиОтчетность) Тогда 

		ТекущийОбъект.ОбработкаОтчетность = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СокрЛП(АдресОбработкиОтчетность)));
	
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОтчетностьНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогОткрытияФайла.Фильтр				 = НСтр("ru = 'Все файлы'; en = 'All files'")  + "(*.*)|*.*";
	ДиалогОткрытияФайла.Заголовок			 = "Выберите файл";
	ДиалогОткрытияФайла.ПолноеИмяФайла		 = "";
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда

		АдресОбработкиОтчетность = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДиалогОткрытияФайла.ПолноеИмяФайла), Объект.Ссылка.УникальныйИдентификатор());

		МассивСтрок = СтрРазделить(ДиалогОткрытияФайла.ПолноеИмяФайла, "\");
		
		Объект.ДатаЗагрузкиВнешнейОбработкиОтчетность		= ТекущаяДата();
		Объект.ОбработкаОтчетностьНаименование	 			= МассивСтрок.Получить(МассивСтрок.Количество() - 1);
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СохранитьОбработкуОтчетность(Команда)
	Данные = СохранитьОбработкуОтчетностьНаСервере();
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогОткрытияФайла.Фильтр				 = "Произвольный (*." + Прав(Объект.ОбработкаОтчетностьНаименование, 3) + ")|*." + Прав(Объект.ОбработкаПолученияНаименование, 3);
	ДиалогОткрытияФайла.Заголовок			 = "Выберите файл";
	ДиалогОткрытияФайла.ПолноеИмяФайла		 = Объект.ОбработкаОтчетностьНаименование;
	ДиалогОткрытияФайла.МножественныйВыбор	 = Ложь;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		Данные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		
	КонецЕсли;     
КонецПроцедуры

&НаСервере
Функция СохранитьОбработкуОтчетностьНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Возврат  Об.ОбработкаОтчетность.Получить();
	
	//Возврат Справочники.Обработки.ПолучитьОбработку(РеквизитФормыВЗначение("Объект"));
	
КонецФункции

//***************************************************************************************************
